ember-rails-complete-app-ex/rails-complete-app-ex/app/controllers/api/v1/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "0000marcell@gmail.com"]]
---
	def create
	  @user = User.find_by(email: params[:user][:email].downcase)

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$mti1p0NUapau9efk0E0mFe9dZoZHSVcjyGJqlUuwbd5XKd8PIjN1q"], ["updated_at", "2016-07-04 12:53:37.835414"], ["id", 1]]
---
	def update
		flash.now[:green] = "Changing user"
		if params[:user][:password].empty?
			@user.errors.add(:password, "can't be empty")
			flash.now[:red] = "Password can't be blank"
			render 'edit'
		elsif @user.update_attributes(user_params)