ember-rails-complete-app-ex/rails-complete-app-ex/app/controllers/api/v1/tasks_controller.rb

  def index
		if params[:search] != ''
			@api_v1_tasks = Task.search(params[:search]).order("created_at DESC")
		elsif params[:page]
			@api_v1_tasks = Task.page(params[:page][:number]).per(params[:page][:size])
---
SELECT "tasks".* FROM "tasks" WHERE (title LIKE '%4%') ORDER BY created_at DESC
SELECT  "tasks".* FROM "tasks" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "tasks"

  def create
		@api_v1_task = current_resource_owner.tasks.build(api_v1_task_params)
    if @api_v1_task.save
---
INSERT INTO "tasks" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Task"], ["user_id", 1], ["created_at", 2016-07-20 14:35:30 UTC], ["updated_at", 2016-07-20 14:35:30 UTC]]

  def update
	@api_v1_task = current_resource_owner.tasks.find(params[:id])
    if @api_v1_task.update(api_v1_task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Task 5 Edited"], ["updated_at", 2016-07-20 15:31:21 UTC], ["id", 6]]

  def destroy
		current_resource_owner.tasks.find(params[:id]).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]