ember-rails-complete-app-ex/rails-complete-app-ex/app/controllers/api/v1/todos_controller.rb

  def index
		@api_v1_todos = Todo.all
---
SELECT "todos".* FROM "todos" WHERE (title LIKE '%Todo 5%')  ORDER BY created_at DESC

  def create
		@api_v1_todo = current_resource_owner.todos.build(api_v1_todo_params)
    if @api_v1_todo.save
---
INSERT INTO "todos" ("title", "slug", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "my new todo"], ["slug", "my-new-todo"], ["user_id", 1], ["created_at", "2016-07-12 17:32:12.982513"], ["updated_at", "2016-07-12 17:32:12.982513"]]

  def update
	@api_v1_todo = current_resource_owner.todos.find(params[:id])
    if @api_v1_todo.update(api_v1_todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Todo Edited"], ["updated_at", "2016-07-12 16:56:34.146813"], ["id", 2]]

  def destroy
		current_resource_owner.todos.find(params[:id]).destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]

    def set_api_v1_todo
			debugger
      @api_v1_todo = Todo.find_by_slug(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."slug" = ? LIMIT 1  [["slug", "3"]]