ember-rails-complete-app-ex/rails-complete-app-ex/app/controllers/api/v1/todos_controller.rb

SELECT  "todos".* FROM "todos" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "todos"
---
  def index
		if params[:page]
			@api_v1_todos = Todo.page(params[:page][:number]).per(params[:page][:size])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_api_v1_todo
      @api_v1_todo = Todo.find(params[:id])