javascript/ember/ember-rails-complete-app-ex/rails-complete-app-ex/app/controllers/api/v1/users_controller.rb

	def show
		# work around for ember data
		if(params[:id].to_i != 0)
			@user = User.find(params[:id])
		else
			@user = User.find_by_username(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "____marcell"]]

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?)