javascript/ember/ember-rails-complete-app-ex/rails-complete-app-ex/app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "0000marcell@gmail.com"]]
UPDATE "users" SET "activated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated_at", "2016-07-11 12:49:01.626651"], ["updated_at", "2016-07-11 12:49:01.627552"], ["id", 2]]
---
	def edit
		user = User.find_by(email: params[:email])
		if user && !user.activated? && user.authenticated?(:activation, params[:id])
			user.activate
			user.update_attribute(:activated,    true)