javascript/ember/ember-rails-complete-app-ex/rails-complete-app-ex/app/controllers/custom_tokens_controller.rb

	def create
		puts "### custom tokens "
		response = strategy.authorize
		body = response.body
		if response.status == :ok
			user = User.find(response.token.resource_owner_id) rescue nil
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]